---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.IsSystemsEnabled
source: html/0c1990c2-b82b-63a2-fc14-0cae931f8ba8.htm
---
# Autodesk.Revit.ApplicationServices.Application.IsSystemsEnabled Property

Checks whether or not any systems disciplines (mechanical, electrical, or piping) are enabled.

## Syntax (C#)
```csharp
public bool IsSystemsEnabled { get; }
```